docs: add complete documentation
